{"data":{"session":{"speaker":"Shiva Agolla","speaker2":"Mike Buening","bio":"Shiva has lead large Digital Transformation, Automation and Quality Engineering, developed and implemented Quality methodologies, embedding Cognitive QA into the solutions and built and led diversified teams. At Sogeti, he enables clients gain efficiencies in their quality practices while increasing the overall quality of the product through increased automation with agility. He provides forward thinking leadership to large teams, guides the vision, plan, and implementation of quality engineering programs for enterprises and clients across the State as well Nationally. Shiva lives in Columbus.","bio2":"Mike is a Director in the Digital Assurance & Quality Engineering practice with Sogeti. He has over 22 years’ experience in IT serving a variety of roles including business analyst, test lead, project manager, QA manager, program manager, and department head responsible for development, testing, and operations of information systems to a global audience. His experience includes working with chemical information systems, patent information systems, search engine development, non-profit business, and public utilities. He lives in central Ohio with his wife, three kids, and two dogs.","title":"New rules for smarter and faster testing","abstract":"The World Quality Report is the only global report analyzing software testing and quality engineering trends. It presents an analysis of developments in agile and DevOps, artificial intelligence, automation, test environments, data, security and budgets, showing once again the importance of quality, and of the measures that are put in place to maintain it with sector focus. The 11th Edition of this report captures insight from interviews with 1,725 CIOs and senior technology leaders from 32 countries and 10 industries.\n\nPresentation:\n•Artificial Intelligence can make testing smarter – but broader QA skills are needed\n•Test automation cannot keep pace with the demand for rapid development\n\nPanel:\n•Elite local panel discussion on the trends that are more pertinent for us here in Central Ohio\n\nLink to The World Quality Report https://www.sogeti.com/explore/reports/world-quality-report-2019/","time":"10:30 - 11:30","room":"Interfaith Room","linkedin":"https://www.linkedin.com/in/shivaagolla","twitter":"","website":"","linkedin2":"https://www.linkedin.com/in/mikebuening","twitter2":"","website2":""}},"context":{}}