{"data":{"session":{"speaker":"Anita Uppalapati","speaker2":"Joseph Beale","bio":"Anita Uppalapati is the NF Quality Engineering Coach at Nationwide. She has led testing efforts on a range of programs and projects that are Tier 1 and Tier 2 such as Personal Lines Transformation Release 2.0, New Company, Goal State Underwriting, SmartRide, etc. She enjoys working with Application teams, listening and understanding their current testing challenges, identifying complex workflows that are manual intense by experimenting, designing and building innovative automation solutions that include risk-based testing and reusability that enable application teams to efficiently test E2E to help save time and money and deliver faster software releases.","bio2":"Joseph Beale is a Lead Consultant for Tricentis who travels all over the country helping clients implement test automation and training them on the Tosca automation tool. Joe lives in Columbus and is one of the organizers for the QA or the Highway conference. Joe has over 20 years of experience in systems and has been focused on Test Automation since 2012.","title":"Going Scriptless: Implementing Model-Based Test Automation in a Large Enterprise","abstract":"Over the past year Nationwide Insurance has moved in the direction of using a scriptless model for automating their software testing with a tool called Tosca. Join us for a discussion of this topic with the following highlights:\n\nAnita Uppalapati of Nationwide will describe the journey, why they made this decision, and how it is being rolled out in waves.\n\nJoseph Beale of COSQAM will talk about the benefits of scriptless automation versus other methods and go deep into model-based automation using the Tosca tool.\n\nThere will also be a general discussion around how this type of test automation changes the nature of testing teams and contributes to the overall digital transformation process.","time":"9:15 - 10:15","room":"Great Hall 1 & 2","linkedin":"https://www.linkedin.com/in/anita-uppalapati-40b258116","twitter":"","website":"","linkedin2":"https://www.linkedin.com/in/josephbealeqa","twitter2":"https://twitter.com/JosephBealeQA","website2":"https://www.tricentis.com/"}},"context":{}}