{"data":{"session":{"speaker":"Max Saperstone","speaker2":"","bio":"Max Saperstone has been working as a Software and Test Engineer for over a decade, with a focus on Test Automation within the CI/CD process. He specializes in open source tools, including the Selenium Tool Suite, JMeter, AutoIT, Cucumber, and Chef. Max is the Director of Test and Automation at Coveros, where he works as a test strategist and architect; he works with organizations to determine how best to test the application across the organization to ensure high quality and low risk releases. He currently heads up the development of Selenified, an open sourced testing framework to allow testing of multiple interfaces, custom reporting, and minimal test upkeep.\n\nIn addition to working heavily under the testing umbrella, Max is also an experienced Agile developer, and he is well versed in Agile processes and practices. He is an ICAgile Certified Professional (ICP). Max has spoken at multiple conferences including STARCanada, STAREast, Mobile Dev and Test, and AgileDC, and is currently an instructor for several courses.","bio2":"","title":"Getting to Continuous Testing","abstract":"Max will tell the story of how a healthcare company striving to get to continuous releases built up their automation to secure confidence in regular releases. Initially, as no test automation existed, Max was able to take a greenfield test automation opportunity, and in the span of 12 months, develop over 2000 test cases. A testing pipeline was created to verify the integrity of the automated test cases, and to build docker containers for simple execution of the tests. These containers could then be simply re-used by developers and the DevOps team to verify the application. Max will walk through the feedback loop created, which allowed verification of the application go from hours to minutes.\n\nMax will discuss what processes and paths were taken to achieve continuous testing on this project. While he will cover the tools used and why they were chosen, the main focus will be on the HOW and WHY certain patterns and activities were performed. These choices were critical to achieving continuous testing, rather than just good testing coverage in CI or CD, even allowing a push left for performance and security. Additionally, some time will be spent on the organizational and culture changes that occured, and how he was able to accomplish this push for adoption in an organization that resisted automation, and had major quality problems.","time":"1:55 - 2:55","room":"Great Hall 3","linkedin":"https://www.linkedin.com/in/maxsaperstone","twitter":"https://twitter.com/Automate_Tests","website":"https://www.coveros.com/","linkedin2":"","twitter2":"","website2":""}},"context":{}}