{"data":{"session":{"speaker":"Jeff Van Fleet","speaker2":"Mark Adams","bio":"THE GEEK: Jeff Van Fleet, President, Lighthouse Technologies\n\nAfter spending over 20 years managing, developing, and deploying complex software/hardware systems for both commercial and Department of Defense (DoD) applications, Jeff founded  Lighthouse in 2000 with the aim of establishing a company whose customer service was only eclipsed by the quality of its work.  Armed with an encyclopedic knowledge of motivational leadership tactics and a wealth of expertise in software quality assurance (QA) processes and technical leadership, he’s a both a hands-on company leader and the primary architect of Lighthouse’s celebrated workplace culture. Jeff is a proud graduate of Penn State University where he played the trumpet in the marching Blue Band.","bio2":"THE COACH: Mark Adams, ESPN National College Basketball Analyst and VP of Client Success, Lighthouse Technologies\n\nFormer coach Mark Adams has been a national men’s college basketball analyst for ESPN since 1999. Adams is a real coach who develops strategies for IT teams struggling with leadership, communication, and teamwork. Previously, Adams enjoyed a 17-year college coaching career with a proven track record of rebuilding struggling programs. Between his three college head coaching jobs, those teams had a combined winning percentage of 34 percent (28-54) in the season before Adams took over. In his final season at each of the three universities, he led them to a combined 59-32 record, a 65 percent winning percentage, with two championships and Coach of the Year honors in 1989. He also held assistant coaching positions at Washington State University and Idaho State University, where he earned his master’s degree in athletic administration.","title":"A Coach and a Geek:  How to Coach, Test, Measure and Build an Accountable Quality Team!","abstract":"Mark Adams, ESPN's National College Basketball Analyst and VP of Client Success for Lighthouse Technologies and Jeff Van Fleet, President of Lighthouse Technologies combine their passion for coaching, testing, quality and team building in this unique, fun and interactive 60 minute presentation. Learn how a coach and a geek have joined forces to help IT teams effect change, drive better productivity, challenge the status quo and become better quality teams.","time":"9:15 - 10:15","room":"Interfaith Room","linkedin":"https://www.linkedin.com/in/eran-kinsbruner-4b47a81","twitter":"https://twitter.com/lighthousetechteam","website":"https://lighthousetechnologies.com","linkedin2":"https://www.linkedin.com/in/lighthouse-technologies-inc-b36a3559","twitter2":"https://twitter.com/enthusiadams","website2":"https://lighthousetechnologies.com"}},"context":{}}