{"data":{"session":{"speaker":"Deepika Achary","speaker2":"","bio":"Deepika Achary is a Test Engineer at OCLC. She joined OCLC in 2018 where she currently automates tests for big data technologies. She holds a bachelor’s degree in Electronics and Communications Engineering from Biju Patnaik University, India. She has a prior work experience as a test automation developer with Tata Consultancy Services. Some of her strengths are building and maintaining test automation frameworks. She has a knack towards problem solving and possesses great analytical skills. Deepika is trained in an Indian classical dance form called Odissi which she practices in her spare time and loves to paint.","bio2":"","title":"A Glimpse of Test Automation in Hadoop Ecosystem","abstract":"Big data is a buzzword that describes a huge volume of both structured and unstructured data that is huge and challenging to process using traditional software engineering techniques. This extensive data is processed through Hadoop ecosystem.\n\nWhile big data provides solutions to complex business problems, it poses bigger challenges in testing these scenarios such as effectively managing, maintaining and using the data. This makes testing big data applications different and significantly more complex than testing regular applications. Data is transferred and transformed among many services and needs to be validated at various transition points and processes such as data ingestion, data processing and data storage.\n\nWe will be focusing on how to interact with these components in a test automation framework:\n1. HDFS – Highly fault-tolerant distributed file system for processing large data sets.\n2. HBASE – Highly scalable non-relational database.\n3. KAFKA - A messaging system that lets you send messages between processes, applications, and servers.\n4. SOLR – Lucene based search platform.\n\nWe will demonstrate the processes and tools we have successfully implemented in our test automation. By using this automation approach, we have achieved faster feedback and low manual intervention during the testing process. This helped us a lot to do effective functional verification and getting accurate results. We will explore different ways and also share tips that can help every tester, new or seasoned, to understand how to use automation as part of testing the above-mentioned Hadoop ecosystem components.","time":"1:55 - 2:55","room":"Student Alumni Room","linkedin":"https://www.linkedin.com/in/deepika-achary","twitter":"","website":"","linkedin2":"","twitter2":"","website2":""}},"context":{}}