{"data":{"session":{"speaker":"Andrew Birkholz","speaker2":"","bio":"Andrew is known for solving problems & challenges that no one has been able to resolve. He is a multi-dimensional, technology executive who love’s experimenting with the latest technology and creating software products that help people and companies. Andrew has experience speaking on stages across the United States and is very well respected in the space. He has consulted with hundreds of enterprises over the last 15 years from start-ups to the Fortune 500 companies and helped his clients implement test automation solutions on almost every platform you can think of including: TV's, cars, ships, game consoles, mobile phones, medical devices, multiple mobile applications, software and more. Using that experience, Andrew is now the Chief Technology Officer and Co-founded PinkLion.AI to introduce AI to app teams and help people utilize Artificial Intelligence in a way the benefits their day-to-day job.","bio2":"","title":"Re-Shaping The Test Pyramid","abstract":"In this session Andrew Birkholz will explore new shifts in testing paradigms. Demonstrate an AI first testing method that integrates with your current manual and automation testing, and understand AI that aids your app teams. Re-think where you want to spend time and money in your testing team in a challenge that plagues most companies of too much to test and too little time.\n\nThis will re-position the testing and quality organizations to not be the last part of what happens, but to providing valuable insights and actionable data for your C-Suite to drive business decisions.\n\nKey Takeaways:\n1. Ideas to reshape your test strategies\n2. An understanding of AI solutioning and where to begin implementing\n3. Analysis of available tooling options in the AI space. (Vendor agnostic)","time":"3:05 - 4:05","room":"West Ballroom","linkedin":"https://www.linkedin.com/in/andrewbirkholz","twitter":"https://twitter.com/abirky","website":"https://www.pinklion.ai","linkedin2":"","twitter2":"","website2":""}},"context":{}}