{"data":{"session":{"speaker":"Paul Grizzaffi","speaker2":"","bio":"As a Principal Automation Architect at Magenic, Paul Grizzaffi is following his passion of providing technology solutions to testing, QE, and QA organizations, including automation assessments, implementations, and through activities benefiting the broader testing community. An accomplished keynote speaker and writer, Paul has spoken at local and national conferences and meetings. He is an advisor to Software Test Professionals and STPCon, as well as a member of the Industry Advisory Board of the Advanced Research Center for Software Testing and Quality Assurance (STQA) at UT Dallas where he is a frequent guest lecturer. In addition to spending time with his twins, Paul enjoys sharing his experiences and learning from other testing professionals; his mostly cogent thoughts can be read on his blog at at https://responsibleautomation.wordpress.com.","bio2":"","title":"Testing Your Metal – Drawing Parallels Between Testing Concepts And Heavy Music","abstract":"The phrase \"test your mettle\" means to test what one is made of, what one is prepared to endure. In both testing and automation development, we often have to endure suboptimal situations and difficult challenges such as unrealistic expectations, resistance to change, and an insistence that automation has to come from test cases.\n\nIn coping with these challenges, many people find solace in music; listening to and playing music can be a cathartic experience. Music, specifically titles and lyrics, can also be thought-provoking and motivating. Paul Grizzaffi, a self-proclaimed metalhead and rock-a-holic, is one of those people who is greatly affected by music. He not only has experience with testing and automation, he’s quite the aficionado of heavy music. His love of automation, testing, and music inspired the pun in the title.\n\nJoin us as Paul takes us on a tour of some impactful lyrics and song titles that frame memorable messages about testing and automation. Among the featured messages: we make our own expectations, automation is software development, and there are important business aspects related to automation and testing that cannot be ignored. \n\nTakeaways:\n• Find your friendlies; they can help evangelize your message\n• Automation does not replace testers; it does not have to come from test cases\n• Only automate if there is value, not just because of process.","time":"4:15 - 5:15","room":"East Ballroom","linkedin":"https://www.linkedin.com/in/paulgrizzaffi","twitter":"https://twitter.com/pgrizzaffi","website":"https://responsibleautomation.wordpress.com","linkedin2":"","twitter2":"","website2":""}},"context":{}}