{"data":{"session":{"speaker":"Dennis Colburn","speaker2":"","bio":"Dennis is a test automation consultant who has been working at Sogeti since March 2017.  He spent most of his career as a software developer but was exposed to automated testing in 2011 while working at Nationwide Insurance.  He was intrigued by the new method of testing and has been striving to mature test automation in the data warehouse/ETL domains at every company he was worked with since.\n\nDennis grew up in Columbus and graduated with a B.S. in Mathematics from Ohio State.  He has 4 kids, a granddaughter, and a yellow lab named Jax.  In his spare time, Dennis likes to read, listen to music,  and play board games and table top rpgs with family and friends.  He is also learning to play the guitar and quickly learning that patience is a virtue in this endeavor.","bio2":"","title":"Automated unit testing frameworks for ETL projects","abstract":"One important characteristic of a “good” piece of software is that it is testable.  If you can’t test something, then how do you know it works?  How do you know that it still works when making future changes?\n\nI’ve been working in data warehouse environments for several years on ETL projects.  I’ve had success implementing automated testing in this domain, but one comment that hear frequently from ETL developers is “oh, you can’t test this Informatica workflow…it’s just too complicated…we don’t have data for that…”.  Well, I think the questions in the first paragraph still apply.  How do I know that my ETL process works if I can’t test it?\n\nIn this session we will focus on unit tests that are applicable in the ETL domain.  We will learn how to identify unit tests, how to setup these unit tests in your automated test framework, and how automating these tests might just change how you design your ETL processes.","time":"10:30 - 11:30","room":"Great Hall 1 & 2","linkedin":"https://www.linkedin.com/in/dennis-colburn","twitter":"https://twitter.com/denniscolburn","website":"","linkedin2":"","twitter2":"","website2":""}},"context":{}}