{"data":{"session":{"speaker":"Eran Kinsbruner","speaker2":"","bio":"Eran Kinsbruner is the chief evangelist at Perfecto (a Perforce company) and the author of ‘The Digital Quality Handbook’ and ‘Continuous Testing for DevOps Professionals’, as well as a monthly columnist at the Enterprisers Project. He is a software engineering professional with nearly twenty years of experience at companies such as Matrix, Sun Microsystems, General Electric, Texas Instruments and NeuStar. He holds various industry certifications from ISTQB, CMMI, and others. Eran is a recognized mobile and web testing influencer and thought leader, as well as an experienced speaker in the major software engineering conferences. He is also a patent-holding inventor for a test exclusion automated mechanism for mobile J2ME testing, public speaker, researcher, and blogger. He can be found all over social media, including on Facebook, Twitter (@ek121268), LinkedIn, and his professional continuous testing blog – http://continuoustesting.blog","bio2":"","title":"Enhancing your Test automation Scenario Coverage Using Selenium","abstract":"Success in cross-browser test automation relies on many variables. Today’s reality forces practitioners within DevOps/Agile teams to join effort in assuring quality, removing risks, and releasing fast. To meet these goals, business testers, developers, and test automation engineers need to work together with the proper technology stack that matches their skillset. Join Perfecto’s Chief Evangelist and author, Eran Kinsbruner, in this session as he provides recommendations for high coverage, high reliability, and maintainability of cross-browser test automation. In this session, Eran will walk through the following topics: - Trends in cross-browser test automation. - Introduction to test automation using codeless and BDD Selenium tools. - The material differences between the three approaches: code-based Selenium, BDD, and codeless. Including a live demo of the various approaches.","time":"10:30 - 11:30","room":"West Ballroom","linkedin":"https://www.linkedin.com/in/eran-kinsbruner-4b47a81","twitter":"","website":"https://continuoustesting.blog","linkedin2":"","twitter2":"","website2":""}},"context":{}}