{"data":{"session":{"speaker":"Anne Hungate","speaker2":"","bio":"Anne Hungate is a technology executive and entrepreneur who guides technology teams through exploration and evolution.  Anne is Head of Infrastructure and Operations for RTI International, an independent nonprofit research institute dedicated to improving the human condition.  Leading a global team of support an operations professionals, Anne is focused on ensuring the team meets the technology needs of projects that cover every corner of the planet. She is founder of Daring Systems, a consulting practice that drives productivity and profitability improvements through operational transparency. Anne is launching her second organization later this year – details to come!\n\nA mother of two teenage daughters, Anne spends her free time driving them to practices, cheering for them on the sidelines, and insisting they clean their rooms.  She and her husband Joe are fitness enthusiasts who make time to play tennis together and run an occasional race. Ohio natives, the Hungates currently live in Apex, NC after a three year stint in the Los Angeles area.  A risk taker and dedicated learner, Anne enjoys writing and attending/speaking at conferences.  She holds DevOps Foundation, DevOps Test Engineer, and professional coaching certifications, and has earned both Certified Software Quality Analyst and Project Management Professional designations.\n\nAnne earned her BS in Analytics from Miami University and her MBA from Case Western Reserve University.","bio2":"","title":"Climbing out of the Box: Bringing Your Quality Career into the Digital Era","abstract":"Deadlines, commitments, policies, and procedures are a few of the many things that are essential for teams and organizations to deliver and grow. But too often, these constructs become constraints on our thinking, our creativity, and our growth as individuals.  Today’s business climate requires fast-paced delivery and real-time interaction with customers; putting our own development second feels necessary for survival.\n\nJoin executive and entrepreneur Anne Hungate for a dynamic exploration of how we can drive satisfaction, career growth, and life balance by climbing outside of the box defined by our roles. A dedicated learner and willing risk-taker, Anne will share her story of applying her learning as a Quality professional to help organizations thrive, and provide real examples of others who have stepped outside of their roles to see the value a Quality mindset provides across organizations.\n\nThe Digital Era needs daring dedication to accuracy and customer experience – perfect conditions for Quality professionals to thrive… if they’re willing to climb out of the box!","time":"4:15 - 5:15","room":"East Ballroom","linkedin":"https://www.linkedin.com/in/annehungate/","twitter":"https://twitter.com/annehungate","website":"https://daringsystems.com/","linkedin2":"","twitter2":"","website2":""}},"context":{}}