{"data":{"session":{"speaker":"Joel Montvelisky","speaker2":"","bio":"Joel Montvelisky is a Co-Founder and Chief Solution Architect at PractiTest. He has been in testing and QA since 1997, working as a tester, QA Manager and Director, and a Consultant for companies in Israel, the US and the EU. Joel is also a blogger with the QA Intelligence Blog, and is constantly imparting webinars on a number of testing and Quality Related topics.  Joel is also the founder and Chair of the OnlineTestConf, and he is also the co-founder of the State of Testing survey and report.  His latest project is the Testing 1on1 podcast with Rob Lambert. Joel is also a conference speaker, presenting in various conferences and forums world wide, among them the Star Conferences, STPCon, JaSST, TestLeadership Conf, CAST, QA&Test, and more.","bio2":"","title":"Let's focus more on Quality and less on Testing","abstract":"What value do you provide to your company?  Testing never has value in itself, testing is a service we provide to our teams so that our company can provide value adding products or services.\n\nToday, due in part to the evolution of development practices and in part due to the adoption of new technologies, engineers who had the exclusive role of being Testing Professionals can now expand their value towards Quality Engineering in the broader sense of the word.\n\nIn this talk we will briefly review the forces pushing forward the changes in the way we write and deliver products today.  We will map the way a traditional tester might fit into this new reality. Then we will explore in depth the additional responsibilities we need to  take as testers in order to provide more value to our organizations as Quality Engineers.\n\nSome of these points have been developed by Alan Page and Brent Jensen as part of the Modern Testing (MT) principles, you can read more about them here - http://moderntesting.org\n\nA large number of data, showing the progress of testing comes from our annual State of Testing Survey and Reports, available here - https://qablog.practitest.com/state-of-testing/\n\nMany of the ideas for the future roles and responsibility of testers come from observations and conversations with hundreds of testing organizations around the world, that I have as part of my role.","time":"12:45 - 1:45","room":"West Ballroom","linkedin":"https://www.linkedin.com/in/joelm3","twitter":"https://twitter.com/joelmonte","website":"https://qablog.practitest.com","linkedin2":"","twitter2":"","website2":""}},"context":{}}