{"data":{"session":{"speaker":"Jennifer Bonine","speaker2":"","bio":"Jennifer Bonine is a well-known speaker, teacher, and trainer at both national and international conferences. She has keynoted numerous Testing, Agile, and Development conferences. Jennifer’s belief is that we should do what we are passionate about and believes in living your passion. To this end, Jennifer co-founded and is the CEO of Pink Lion AI: a breakout AI company that brings AI to the world’s app teams and delivers AI integration with a human engagement model while educating teams on solving challenges with an AI-first strategy. Jennifer is the first female AI testing tech CEO and is currently collaborating in the entertainment, gaming, media and professional sports industries with Test.AI. As Test.AI’s partner PinkLion is solving testing challenges using AI that have been unsolvable with more traditional automation testing. Jennifer has held executive-level positions leading development and quality engineering teams for Fortune 100 companies in several Industries. In a recent engagement Jennifer served as a strategy executive and in corporate marketing for the C-suite.","bio2":"","title":"Re-Shaping The Test Pyramid","abstract":"In this session Jennifer Bonine will explore new shifts in testing paradigms. Demonstrate an AI first testing method that integrates with your current manual and automation testing, and understand AI that aids your app teams. Re-think where you want to spend time and money in your testing team in a challenge that plagues most companies of too much to test and too little time.\n\nThis will re-position the testing and quality organizations to not be the last part of what happens, but to providing valuable insights and actionable data for your C-Suite to drive business decisions.\n\nKey Takeaways:\n1. Ideas to reshape your test strategies\n2. An understanding of AI solutioning and where to begin implementing\n3. Analysis of available tooling options in the AI space. (Vendor agnostic)","time":"1:55 - 2:55","room":"Cartoon Room","linkedin":"https://www.linkedin.com/in/jennifer-bonine-76552b2","twitter":"https://twitter.com/Jennifer_Bonine","website":"https://www.pinklion.ai","linkedin2":"","twitter2":"","website2":""}},"context":{}}