{"data":{"session":{"speaker":"Raj Subrameyer","speaker2":"","bio":"Raj is the Principal Consultant at ChaiLatte Consulting. He helps developer tools and/or services companies build awareness, increase organic website traffic, and generate leads through content creation and social influencer marketing. He also provides test consulting and training to make people and processes more effective.He actively contributes thought leadership and enrichment to the software community through conference talks, contributed articles, blogs and youtube videos, where he shares development,testing, leadership and productivity experiences gained through various development projects. You can read Raj’s expertise on his personal website www.rajsubra.com. He can be reached at raj@rajsubra.com, or follow him on twitter - @epsilon11.","bio2":"","title":"How to develop and test AI Based Systems","abstract":"A recent study conducted by Gartner, shows that by 2020, AI will be pervasive in almost all software products and services. The major highlight of the study was how our skills as engineers would have to adapt accordingly. The current roles in companies are going to change significantly and we need to be prepared for it.  The working of AI is a black box-- we do not control or understand how the algorithm forms different relationships and makes decisions -- we just provide different training datasets and monitor the learning/progress. We are trying to make predictions on future values based on learning from past examples, or trying to discover different patterns from datasets.\n\nCome attend this session where, I discuss the basics of how AI based systems work, what are the key factors to consider when developing and testing these systems and how to come up with an enterprise wide strategy. Finally, I will answer some common questions surrounding AI and also show what are some of the tools available for doing AI based development and testing. This session will help anyone get an understanding of the fundamentals of developing and testing AI based systems.","time":"9:15 - 10:15","room":"Student-Alumni Room","linkedin":"https://www.linkedin.com/in/rajsubra/","twitter":"https://twitter.com/epsilon11","website":"http://www.rajsubra.com/","linkedin2":"","twitter2":"","website2":""}},"context":{}}